<P> <img src="https://i.ibb.co/gyNf19D/nhslogo.png" alt="nhslogo" border="0" width="100" align="right"><font size="6"><b> CS6131 Database Design</b> </font>

# Lab 3

## Question 1: Complex SQL

### Connecting to the Database

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:admin@localhost/

We are using the same company database from the previous lab. <font color='red'>You need not reload the database if the database has been created properly in the last lab.</font>

Run the query below to check that the data has been loaded correctly.

In [4]:
# PrettyTable dependancy has deprecated the default style so needs to be explicitly configured
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [5]:
%%sql
use company;
Select * from department;

 * mysql+pymysql://root:***@localhost/
0 rows affected.
6 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1))]

<font color='red'>The purpose of the lab is to practice nested queries. <b>The use of aggregate function is NOT allowed to answer any of the questions. </b></font>

#### a) Retrieve the name and salary of employees who earn more than the manager of the Sales department using a nested query.

In [26]:
%%sql
SELECT CONCAT(fname, ' ', minit, ' ', lname) as name, salary
FROM employee
WHERE employee.salary > (
    SELECT m.salary 
    FROM employee m 
    WHERE m.ssn IN (
        SELECT mgrssn 
        FROM department 
        WHERE dname = 'Sales'));

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('Jared D James', Decimal('85000.00')),
 ('Evan E Wallis', Decimal('92000.00')),
 ('Alex D Freed', Decimal('89000.00')),
 ('Bob B Bender', Decimal('96000.00'))]

#### b) Rewrite (a) without nested query.

In [60]:
%%sql
SELECT CONCAT(e.fname, ' ', e.minit, ' ', e.lname) as name, e.salary 
FROM employee e
JOIN department d ON d.dname = 'Sales'
JOIN employee m on m.ssn = d.mgrssn
WHERE e.salary > m.salary;

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('Jared D James', Decimal('85000.00')),
 ('Evan E Wallis', Decimal('92000.00')),
 ('Alex D Freed', Decimal('89000.00')),
 ('Bob B Bender', Decimal('96000.00'))]

#### c) Retrieve the full name of all employees who are older than the manager from the Research department using a nested query.

In [63]:
%%sql
SELECT CONCAT(fname, ' ', minit, ' ', lname) as name
FROM employee
WHERE employee.bdate < (
    SELECT m.bdate 
    FROM employee m 
    WHERE m.ssn IN (
        SELECT mgrssn 
        FROM department 
        WHERE dname = 'Research'));

 * mysql+pymysql://root:***@localhost/
3 rows affected.

[('Andy C Vile',), ('James E Borg',), ('Jennifer S Wallace',)]

#### d) Retrieve the name and salary of employees who earn more than all manager of a department using a nested query.

In [64]:
%%sql
SELECT CONCAT(fname, ' ', minit, ' ', lname) as name, salary
FROM employee
WHERE employee.salary > ALL(
    SELECT m.salary 
    FROM employee m 
    WHERE m.ssn IN (
        SELECT mgrssn 
        FROM department));

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[('Evan E Wallis', Decimal('92000.00')), ('Bob B Bender', Decimal('96000.00'))]

#### e) Retrieve the last name of the employees who have the same first name and sex as any dependent using a nested query.

In [71]:
%%sql
SELECT lname
FROM employee
WHERE (fname, sex) IN (
    SELECT dependent_name, sex
    FROM dependent);

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('Snedden',)]

#### f) Rewrite (e) without nested query. (You may assume dependent name is “unique” in the dependent table).

In [73]:
%%sql
SELECT employee.lname
FROM employee
JOIN dependent ON employee.fname = dependent.dependent_name AND employee.sex = dependent.sex;

 * mysql+pymysql://root:***@localhost/
1 rows affected.

[('Snedden',)]

#### g) Retrieve the names of employees who has a dependent using the EXISTS command.

In [78]:
%%sql
SELECT CONCAT(fname, ' ', minit, ' ', lname) as name
FROM employee
WHERE EXISTS (
    SELECT *
    FROM dependent
    WHERE employee.ssn = dependent.essn
);

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('John B Smith',),
 ('Franklin T Wong',),
 ('Alex D Freed',),
 ('Bonnie S Bays',),
 ('Alec C Best',),
 ('Jennifer S Wallace',)]

#### h) Retrieve the social security numbers of all employees who work on project number 1, 2, or 3 using explicit set.

In [88]:
    %%sql
    SELECT essn
    FROM works_on
    WHERE pno in {1, 2, 3}

 * mysql+pymysql://root:***@localhost/
7 rows affected.

[('123456789',),
 ('453453453',),
 ('123456789',),
 ('333445555',),
 ('453453453',),
 ('333445555',),
 ('666884444',)]

In [90]:
%%sql
SELECT DISTINCT essn
FROM works_on
WHERE pno in {1, 2, 3}

 * mysql+pymysql://root:***@localhost/
4 rows affected.

[('123456789',), ('453453453',), ('333445555',), ('666884444',)]

#### i) Using nested query, retrieve the names of all employee whose supervisor’s supervisor has “111111103" for SSN.

In [94]:
%%sql
SELECT CONCAT(e.fname, ' ', e.minit, ' ', e.lname) as name
FROM employee e
JOIN employee s ON e.superssn = s.ssn
WHERE s.superssn = '111111103';

 * mysql+pymysql://root:***@localhost/
19 rows affected.

[('Jon C Jones',),
 ('Justin n Mark',),
 ('Ahmad V Jabbar',),
 ('Josh U Zell',),
 ('Andy C Vile',),
 ('Tom G Brand',),
 ('John B Smith',),
 ('Jeff H Chase',),
 ('Joyce A English',),
 ('Ramesh K Narayan',),
 ('Bonnie S Bays',),
 ('Alec C Best',),
 ('Sam S Snedden',),
 ('Nandita K Ball',),
 ('Jill J Jarvis',),
 ('Kate W King',),
 ('Franklin T Wong',),
 ('Jennifer S Wallace',),
 ('Alicia J Zelaya',)]

#### j) Using nested query, retrieve the names of all employee who make at least $30,000 more than the employee who is paid the least in the company.

In [126]:
%%sql
SELECT CONCAT(e.fname, ' ', e.minit, ' ', e.lname) as name
FROM employee e
WHERE salary - 30000 >= (
    SELECT DISTINCT salary
    FROM employee e1
    WHERE salary < ALL(
        SELECT salary
        FROM employee e2
        WHERE e1.salary != e2.salary
    ));

 * mysql+pymysql://root:***@localhost/
13 rows affected.

[('Jared D James',),
 ('Evan E Wallis',),
 ('Josh U Zell',),
 ('Tom G Brand',),
 ('Jenny F Vos',),
 ('Kim C Grace',),
 ('Alex D Freed',),
 ('Bonnie S Bays',),
 ('Alec C Best',),
 ('John C James',),
 ('Nandita K Ball',),
 ('Bob B Bender',),
 ('James E Borg',)]

#### k) Retrieve the names of employees who do not work on any project.

In [129]:
%%sql
SELECT CONCAT(e.fname, ' ', e.minit, ' ', e.lname) as name
FROM employee e
WHERE ssn NOT IN(
    SELECT DISTINCT essn 
    FROM works_on);

 * mysql+pymysql://root:***@localhost/
2 rows affected.

[('Bob B Bender',), ('Kate W King',)]

## Question 2: Understanding Joins

Read the following page from mySQL reference manual: <br>
https://dev.mysql.com/doc/refman/8.0/en/join.html

Using appropriate examples from the COMPANY database, explain the difference between the following joins: <br>
`Join, Left Join, Right Join, Natural Join`

Give an example on how to use each type of join.

In [150]:
%%sql #Join
SELECT e.salary as 'supervised salary', m.salary as 'supervisor salary'
FROM employee e
JOIN employee m ON m.ssn = e.superssn;

 * mysql+pymysql://root:***@localhost/
39 rows affected.

[(Decimal('85000.00'), Decimal('44000.00')),
 (Decimal('45000.00'), Decimal('85000.00')),
 (Decimal('40000.00'), Decimal('85000.00')),
 (Decimal('30000.00'), Decimal('79000.00')),
 (Decimal('92000.00'), Decimal('44000.00')),
 (Decimal('56000.00'), Decimal('92000.00')),
 (Decimal('53000.00'), Decimal('92000.00')),
 (Decimal('62500.00'), Decimal('92000.00')),
 (Decimal('61000.00'), Decimal('56000.00')),
 (Decimal('43000.00'), Decimal('56000.00')),
 (Decimal('79000.00'), Decimal('44000.00')),
 (Decimal('44000.00'), Decimal('79000.00')),
 (Decimal('40000.00'), Decimal('55000.00')),
 (Decimal('89000.00'), Decimal('44000.00')),
 (Decimal('70000.00'), Decimal('89000.00')),
 (Decimal('60000.00'), Decimal('89000.00')),
 (Decimal('48000.00'), Decimal('89000.00')),
 (Decimal('25000.00'), Decimal('79000.00')),
 (Decimal('81000.00'), Decimal('44000.00')),
 (Decimal('62000.00'), Decimal('81000.00')),
 (Decimal('96000.00'), Decimal('44000.00')),
 (Decimal('36000.00'), Decimal('96000.00')),
 (Decimal('44000.00'), Decimal('96000.00')),
 (Decimal('41000.00'), Decimal('36000.00')),
 (Decimal('38000.00'), Decimal('41000.00')),
 (Decimal('41500.00'), Decimal('41000.00')),
 (Decimal('44500.00'), Decimal('38000.00')),
 (Decimal('29000.00'), Decimal('44000.00')),
 (Decimal('33000.00'), Decimal('44000.00')),
 (Decimal('32000.00'), Decimal('44000.00')),
 (Decimal('34000.00'), Decimal('29000.00')),
 (Decimal('32000.00'), Decimal('34000.00')),
 (Decimal('37000.00'), Decimal('32000.00')),
 (Decimal('33500.00'), Decimal('37000.00')),
 (Decimal('38000.00'), Decimal('79000.00')),
 (Decimal('55000.00'), Decimal('44000.00')),
 (Decimal('43000.00'), Decimal('55000.00')),
 (Decimal('25000.00'), Decimal('85000.00')),
 (Decimal('25000.00'), Decimal('55000.00'))]

In [ ]:
%%sql #Left Join
SELECT *
FROM employee
LEFT JOIN works_on ON employee.ssn = works_on.essn;

 * mysql+pymysql://root:***@localhost/
48 rows affected.

[('Jared', 'D', 'James', '111111100', datetime.date(1966, 10, 10), '123 Peachtree, Atlanta, GA', 'M', Decimal('85000.00'), '111111103', 6, '111111100', 61, Decimal('40.0')),
 ('Jon', 'C', 'Jones', '111111101', datetime.date(1967, 11, 14), '111 Allgood, Atlanta, GA', 'M', Decimal('45000.00'), '111111100', 6, '111111101', 61, Decimal('40.0')),
 ('Justin', 'n', 'Mark', '111111102', datetime.date(1966, 1, 12), '2342 May, Atlanta, GA', 'M', Decimal('40000.00'), '111111100', 6, '111111102', 61, Decimal('40.0')),
 ('Brad', 'C', 'Knight', '111111103', datetime.date(1968, 2, 13), '176 Main St., Atlanta, GA', 'M', Decimal('44000.00'), None, 6, '111111103', 61, Decimal('40.0')),
 ('John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('30000.00'), '333333300', 5, '123456789', 1, Decimal('32.5')),
 ('John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('30000.00'), '333333300', 5, '123456789', 2, Decimal('7.5')),
 ('Evan', 'E', 'Wallis', '222222200', datetime.date(1958, 1, 16), '134 Pelham, Milwaukee, WI', 'M', Decimal('92000.00'), '111111103', 7, '222222200', 62, Decimal('40.0')),
 ('Josh', 'U', 'Zell', '222222201', datetime.date(1954, 5, 22), '266 McGrady, Milwaukee, WI', 'M', Decimal('56000.00'), '222222200', 7, '222222201', 62, Decimal('48.0')),
 ('Andy', 'C', 'Vile', '222222202', datetime.date(1944, 6, 21), '1967 Jordan, Milwaukee, WI', 'M', Decimal('53000.00'), '222222200', 7, '222222202', 62, Decimal('40.0')),
 ('Tom', 'G', 'Brand', '222222203', datetime.date(1966, 12, 16), '112 Third St, Milwaukee, WI', 'M', Decimal('62500.00'), '222222200', 7, '222222203', 62, Decimal('40.0')),
 ('Jenny', 'F', 'Vos', '222222204', datetime.date(1967, 11, 11), '263 Mayberry, Milwaukee, WI', 'F', Decimal('61000.00'), '222222201', 7, '222222204', 62, Decimal('40.0')),
 ('Chris', 'A', 'Carter', '222222205', datetime.date(1960, 3, 21), '565 Jordan, Milwaukee, WI', 'F', Decimal('43000.00'), '222222201', 7, '222222205', 62, Decimal('40.0')),
 ('Kim', 'C', 'Grace', '333333300', datetime.date(1970, 10, 23), '6677 Mills Ave, Sacramento, CA', 'F', Decimal('79000.00'), '111111103', 6, '333333300', 63, Decimal('40.0')),
 ('Jeff', 'H', 'Chase', '333333301', datetime.date(1970, 1, 7), '145 Bradbury, Sacramento, CA', 'M', Decimal('44000.00'), '333333300', 6, '333333301', 63, Decimal('46.0')),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5, '333445555', 2, Decimal('10.0')),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5, '333445555', 3, Decimal('10.0')),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5, '333445555', 10, Decimal('10.0')),
 ('Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5, '333445555', 20, Decimal('10.0')),
 ('Alex', 'D', 'Freed', '444444400', datetime.date(1950, 10, 9), '4333 Pillsbury, Milwaukee, WI', 'M', Decimal('89000.00'), '111111103', 7, '444444400', 91, Decimal('40.0')),
 ('Bonnie', 'S', 'Bays', '444444401', datetime.date(1956, 6, 19), '111 Hollow, Milwaukee, WI', 'F', Decimal('70000.00'), '444444400', 7, '444444401', 91, Decimal('40.0')),
 ('Alec', 'C', 'Best', '444444402', datetime.date(1966, 6, 18), '233 Solid, Milwaukee, WI', 'M', Decimal('60000.00'), '444444400', 7, '444444402', 91, Decimal('40.0')),
 ('Sam', 'S', 'Snedden', '444444403', datetime.date(1977, 7, 31), '987 Windy St, Milwaukee, WI', 'M', Decimal('48000.00'), '444444400', 7, '444444403', 91, Decimal('40.0')),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('25000.00'), '333333300', 5, '453453453', 1, Decimal('20.0')),
 ('Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('25000.00'), '333333300', 5, '453453453', 2, Decimal('20.0')),
 ('John', 'C', 'James', '555555500', datetime.date(1975, 6, 30), '7676 Bloomington, Sacramento, CA', 'M', Decimal('81000.00'), '111111103', 6, '555555500', 92, Decimal('40.0')),
 ('Nandita', 'K', 'Ball', '555555501', datetime.date(1969, 4, 16), '222 Howard, Sacramento, CA', 'M', Decimal('62000.00'), '555555500', 6, '555555501', 92, Decimal('44.0')),
 ('Jill', 'J', 'Jarvis', '666666601', datetime.date(1966, 1, 14), '6234 Lincoln, Chicago, IL', 'F', Decimal('36000.00'), '666666600', 8, '666666601', 91, Decimal('40.0')),
 ('Lyle', 'G', 'Leslie', '666666603', datetime.date(1963, 6, 9), '417 Hancock Ave, Chicago, IL', 'M', Decimal('41000.00'), '666666601', 8, '666666603', 91, Decimal('40.0')),
 ('Billie', 'J', 'King', '666666604', datetime.date(1960, 1, 1), '556 Washington, Chicago, IL', 'F', Decimal('38000.00'), '666666603', 8, '666666604', 91, Decimal('40.0')),
 ('Jon', 'A', 'Kramer', '666666605', datetime.date(1964, 8, 22), '1988 Windy Creek, Seattle, WA', 'M', Decimal('41500.00'), '666666603', 8, '666666605', 92, Decimal('40.0')),
 ('Ray', 'H', 'King', '666666606', datetime.date(1949, 8, 16), '213 Delk Road, Seattle, WA', 'M', Decimal('44500.00'), '666666604', 8, '666666606', 91, Decimal('40.0')),
 ('Gerald', 'D', 'Small', '666666607', datetime.date(1962, 5, 15), '122 Ball Street, Dallas, TX', 'M', Decimal('29000.00'), '666666602', 8, '666666607', 61, Decimal('40.0')),
 ('Arnold', 'A', 'Head', '666666608', datetime.date(1967, 5, 19), '233 Spring St, Dallas, TX', 'M', Decimal('33000.00'), '666666602', 8, '666666608', 62, Decimal('40.0')),
 ('Helga', 'C', 'Pataki', '666666609', datetime.date(1969, 3, 11), '101 Holyoke St, Dallas, TX', 'F', Decimal('32000.00'), '666666602', 8, '666666609', 63, Decimal('40.0')),
 ('Naveen', 'B', 'Drew', '666666610', datetime.date(1970, 5, 23), '198 Elm St, Philadelphia, PA', 'M', Decimal('34000.00'), '666666607', 8, '666666610', 61, Decimal('40.0')),
 ('Carl', 'E', 'Reedy', '666666611', datetime.date(1977, 6, 21), '213 Ball St, Philadelphia, PA', 'M', Decimal('32000.00'), '666666610', 8, '666666611', 61, Decimal('40.0')),
 ('Sammy', 'G', 'Hall', '666666612', datetime.date(1970, 1, 11), '433 Main Street, Miami, FL', 'M', Decimal('37000.00'), '666666611', 8, '666666612', 61, Decimal('40.0')),
 ('Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8, '666666613', 61, Decimal('30.0')),
 ('Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8, '666666613', 62, Decimal('10.0')),
 ('Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8, '666666613', 63, Decimal('10.0')),
 ('Ramesh', 'K', 'Narayan', '666884444', datetime.date(1952, 9, 15), '971 Fire Oak, Humble, TX', 'M', Decimal('38000.00'), '333333300', 5, '666884444', 3, Decimal('40.0')),
 ('James', 'E', 'Borg', '888665555', datetime.date(1927, 11, 10), '450 Stone, Houston, TX', 'M', Decimal('55000.00'), '111111103', 1, '888665555', 20, None),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1931, 6, 20), '291 Berry, Bellaire, TX', 'F', Decimal('43000.00'), '888665555', 4, '987654321', 20, Decimal('15.0')),
 ('Jennifer', 'S', 'Wallace', '987654321', datetime.date(1931, 6, 20), '291 Berry, Bellaire, TX', 'F', Decimal('43000.00'), '888665555', 4, '987654321', 30, Decimal('20.0')),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1959, 3, 29), '980 Dallas, Houston, TX', 'M', Decimal('25000.00'), '111111100', 4, '987987987', 10, Decimal('35.0')),
 ('Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1959, 3, 29), '980 Dallas, Houston, TX', 'M', Decimal('25000.00'), '111111100', 4, '987987987', 30, Decimal('5.0')),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1958, 7, 19), '3321 Castle, Spring, TX', 'F', Decimal('25000.00'), '888665555', 4, '999887777', 10, Decimal('10.0')),
 ('Alicia', 'J', 'Zelaya', '999887777', datetime.date(1958, 7, 19), '3321 Castle, Spring, TX', 'F', Decimal('25000.00'), '888665555', 4, '999887777', 30, Decimal('30.0'))]

In [154]:
%%sql #Right Join
SELECT *
FROM works_on
RIGHT JOIN employee ON employee.ssn = works_on.essn;

 * mysql+pymysql://root:***@localhost/
50 rows affected.

[('111111100', 61, Decimal('40.0'), 'Jared', 'D', 'James', '111111100', datetime.date(1966, 10, 10), '123 Peachtree, Atlanta, GA', 'M', Decimal('85000.00'), '111111103', 6),
 ('111111101', 61, Decimal('40.0'), 'Jon', 'C', 'Jones', '111111101', datetime.date(1967, 11, 14), '111 Allgood, Atlanta, GA', 'M', Decimal('45000.00'), '111111100', 6),
 ('111111102', 61, Decimal('40.0'), 'Justin', 'n', 'Mark', '111111102', datetime.date(1966, 1, 12), '2342 May, Atlanta, GA', 'M', Decimal('40000.00'), '111111100', 6),
 ('111111103', 61, Decimal('40.0'), 'Brad', 'C', 'Knight', '111111103', datetime.date(1968, 2, 13), '176 Main St., Atlanta, GA', 'M', Decimal('44000.00'), None, 6),
 ('123456789', 1, Decimal('32.5'), 'John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('30000.00'), '333333300', 5),
 ('123456789', 2, Decimal('7.5'), 'John', 'B', 'Smith', '123456789', datetime.date(1955, 1, 9), '731 Fondren, Houston, TX', 'M', Decimal('30000.00'), '333333300', 5),
 ('222222200', 62, Decimal('40.0'), 'Evan', 'E', 'Wallis', '222222200', datetime.date(1958, 1, 16), '134 Pelham, Milwaukee, WI', 'M', Decimal('92000.00'), '111111103', 7),
 ('222222201', 62, Decimal('48.0'), 'Josh', 'U', 'Zell', '222222201', datetime.date(1954, 5, 22), '266 McGrady, Milwaukee, WI', 'M', Decimal('56000.00'), '222222200', 7),
 ('222222202', 62, Decimal('40.0'), 'Andy', 'C', 'Vile', '222222202', datetime.date(1944, 6, 21), '1967 Jordan, Milwaukee, WI', 'M', Decimal('53000.00'), '222222200', 7),
 ('222222203', 62, Decimal('40.0'), 'Tom', 'G', 'Brand', '222222203', datetime.date(1966, 12, 16), '112 Third St, Milwaukee, WI', 'M', Decimal('62500.00'), '222222200', 7),
 ('222222204', 62, Decimal('40.0'), 'Jenny', 'F', 'Vos', '222222204', datetime.date(1967, 11, 11), '263 Mayberry, Milwaukee, WI', 'F', Decimal('61000.00'), '222222201', 7),
 ('222222205', 62, Decimal('40.0'), 'Chris', 'A', 'Carter', '222222205', datetime.date(1960, 3, 21), '565 Jordan, Milwaukee, WI', 'F', Decimal('43000.00'), '222222201', 7),
 ('333333300', 63, Decimal('40.0'), 'Kim', 'C', 'Grace', '333333300', datetime.date(1970, 10, 23), '6677 Mills Ave, Sacramento, CA', 'F', Decimal('79000.00'), '111111103', 6),
 ('333333301', 63, Decimal('46.0'), 'Jeff', 'H', 'Chase', '333333301', datetime.date(1970, 1, 7), '145 Bradbury, Sacramento, CA', 'M', Decimal('44000.00'), '333333300', 6),
 ('333445555', 2, Decimal('10.0'), 'Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('333445555', 3, Decimal('10.0'), 'Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('333445555', 10, Decimal('10.0'), 'Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('333445555', 20, Decimal('10.0'), 'Franklin', 'T', 'Wong', '333445555', datetime.date(1945, 12, 8), '638 Voss, Houston, TX', 'M', Decimal('40000.00'), '888665555', 5),
 ('444444400', 91, Decimal('40.0'), 'Alex', 'D', 'Freed', '444444400', datetime.date(1950, 10, 9), '4333 Pillsbury, Milwaukee, WI', 'M', Decimal('89000.00'), '111111103', 7),
 ('444444401', 91, Decimal('40.0'), 'Bonnie', 'S', 'Bays', '444444401', datetime.date(1956, 6, 19), '111 Hollow, Milwaukee, WI', 'F', Decimal('70000.00'), '444444400', 7),
 ('444444402', 91, Decimal('40.0'), 'Alec', 'C', 'Best', '444444402', datetime.date(1966, 6, 18), '233 Solid, Milwaukee, WI', 'M', Decimal('60000.00'), '444444400', 7),
 ('444444403', 91, Decimal('40.0'), 'Sam', 'S', 'Snedden', '444444403', datetime.date(1977, 7, 31), '987 Windy St, Milwaukee, WI', 'M', Decimal('48000.00'), '444444400', 7),
 ('453453453', 1, Decimal('20.0'), 'Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('25000.00'), '333333300', 5),
 ('453453453', 2, Decimal('20.0'), 'Joyce', 'A', 'English', '453453453', datetime.date(1962, 7, 31), '5631 Rice, Houston, TX', 'F', Decimal('25000.00'), '333333300', 5),
 ('555555500', 92, Decimal('40.0'), 'John', 'C', 'James', '555555500', datetime.date(1975, 6, 30), '7676 Bloomington, Sacramento, CA', 'M', Decimal('81000.00'), '111111103', 6),
 ('555555501', 92, Decimal('44.0'), 'Nandita', 'K', 'Ball', '555555501', datetime.date(1969, 4, 16), '222 Howard, Sacramento, CA', 'M', Decimal('62000.00'), '555555500', 6),
 (None, None, None, 'Bob', 'B', 'Bender', '666666600', datetime.date(1968, 4, 17), '8794 Garfield, Chicago, IL', 'M', Decimal('96000.00'), '111111103', 8),
 ('666666601', 91, Decimal('40.0'), 'Jill', 'J', 'Jarvis', '666666601', datetime.date(1966, 1, 14), '6234 Lincoln, Chicago, IL', 'F', Decimal('36000.00'), '666666600', 8),
 (None, None, None, 'Kate', 'W', 'King', '666666602', datetime.date(1966, 4, 16), '1976 Boone Trace, Chicago, IL', 'F', Decimal('44000.00'), '666666600', 8),
 ('666666603', 91, Decimal('40.0'), 'Lyle', 'G', 'Leslie', '666666603', datetime.date(1963, 6, 9), '417 Hancock Ave, Chicago, IL', 'M', Decimal('41000.00'), '666666601', 8),
 ('666666604', 91, Decimal('40.0'), 'Billie', 'J', 'King', '666666604', datetime.date(1960, 1, 1), '556 Washington, Chicago, IL', 'F', Decimal('38000.00'), '666666603', 8),
 ('666666605', 92, Decimal('40.0'), 'Jon', 'A', 'Kramer', '666666605', datetime.date(1964, 8, 22), '1988 Windy Creek, Seattle, WA', 'M', Decimal('41500.00'), '666666603', 8),
 ('666666606', 91, Decimal('40.0'), 'Ray', 'H', 'King', '666666606', datetime.date(1949, 8, 16), '213 Delk Road, Seattle, WA', 'M', Decimal('44500.00'), '666666604', 8),
 ('666666607', 61, Decimal('40.0'), 'Gerald', 'D', 'Small', '666666607', datetime.date(1962, 5, 15), '122 Ball Street, Dallas, TX', 'M', Decimal('29000.00'), '666666602', 8),
 ('666666608', 62, Decimal('40.0'), 'Arnold', 'A', 'Head', '666666608', datetime.date(1967, 5, 19), '233 Spring St, Dallas, TX', 'M', Decimal('33000.00'), '666666602', 8),
 ('666666609', 63, Decimal('40.0'), 'Helga', 'C', 'Pataki', '666666609', datetime.date(1969, 3, 11), '101 Holyoke St, Dallas, TX', 'F', Decimal('32000.00'), '666666602', 8),
 ('666666610', 61, Decimal('40.0'), 'Naveen', 'B', 'Drew', '666666610', datetime.date(1970, 5, 23), '198 Elm St, Philadelphia, PA', 'M', Decimal('34000.00'), '666666607', 8),
 ('666666611', 61, Decimal('40.0'), 'Carl', 'E', 'Reedy', '666666611', datetime.date(1977, 6, 21), '213 Ball St, Philadelphia, PA', 'M', Decimal('32000.00'), '666666610', 8),
 ('666666612', 61, Decimal('40.0'), 'Sammy', 'G', 'Hall', '666666612', datetime.date(1970, 1, 11), '433 Main Street, Miami, FL', 'M', Decimal('37000.00'), '666666611', 8),
 ('666666613', 61, Decimal('30.0'), 'Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8),
 ('666666613', 62, Decimal('10.0'), 'Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8),
 ('666666613', 63, Decimal('10.0'), 'Red', 'A', 'Bacher', '666666613', datetime.date(1980, 5, 21), '196 Elm Street, Miami, FL', 'M', Decimal('33500.00'), '666666612', 8),
 ('666884444', 3, Decimal('40.0'), 'Ramesh', 'K', 'Narayan', '666884444', datetime.date(1952, 9, 15), '971 Fire Oak, Humble, TX', 'M', Decimal('38000.00'), '333333300', 5),
 ('888665555', 20, None, 'James', 'E', 'Borg', '888665555', datetime.date(1927, 11, 10), '450 Stone, Houston, TX', 'M', Decimal('55000.00'), '111111103', 1),
 ('987654321', 20, Decimal('15.0'), 'Jennifer', 'S', 'Wallace', '987654321', datetime.date(1931, 6, 20), '291 Berry, Bellaire, TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('987654321', 30, Decimal('20.0'), 'Jennifer', 'S', 'Wallace', '987654321', datetime.date(1931, 6, 20), '291 Berry, Bellaire, TX', 'F', Decimal('43000.00'), '888665555', 4),
 ('987987987', 10, Decimal('35.0'), 'Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1959, 3, 29), '980 Dallas, Houston, TX', 'M', Decimal('25000.00'), '111111100', 4),
 ('987987987', 30, Decimal('5.0'), 'Ahmad', 'V', 'Jabbar', '987987987', datetime.date(1959, 3, 29), '980 Dallas, Houston, TX', 'M', Decimal('25000.00'), '111111100', 4),
 ('999887777', 10, Decimal('10.0'), 'Alicia', 'J', 'Zelaya', '999887777', datetime.date(1958, 7, 19), '3321 Castle, Spring, TX', 'F', Decimal('25000.00'), '888665555', 4),
 ('999887777', 30, Decimal('30.0'), 'Alicia', 'J', 'Zelaya', '999887777', datetime.date(1958, 7, 19), '3321 Castle, Spring, TX', 'F', Decimal('25000.00'), '888665555', 4)]

In [156]:
%%sql #Natural Join
SELECT *
FROM department
NATURAL JOIN dept_locations;

 * mysql+pymysql://root:***@localhost/
13 rows affected.

[(1, 'Headquarters', '888665555', datetime.date(1971, 6, 19), 'Houston'),
 (4, 'Administration', '987654321', datetime.date(1985, 1, 1), 'Stafford'),
 (5, 'Research', '333445555', datetime.date(1978, 5, 22), 'Bellaire'),
 (5, 'Research', '333445555', datetime.date(1978, 5, 22), 'Houston'),
 (5, 'Research', '333445555', datetime.date(1978, 5, 22), 'Sugarland'),
 (6, 'Software', '111111100', datetime.date(1999, 5, 15), 'Atlanta'),
 (6, 'Software', '111111100', datetime.date(1999, 5, 15), 'Sacramento'),
 (7, 'Hardware', '444444400', datetime.date(1998, 5, 15), 'Milwaukee'),
 (8, 'Sales', '555555500', datetime.date(1997, 1, 1), 'Chicago'),
 (8, 'Sales', '555555500', datetime.date(1997, 1, 1), 'Dallas'),
 (8, 'Sales', '555555500', datetime.date(1997, 1, 1), 'Miami'),
 (8, 'Sales', '555555500', datetime.date(1997, 1, 1), 'Philadephia'),
 (8, 'Sales', '555555500', datetime.date(1997, 1, 1), 'Seattle')]

## Question 3: Understanding NULL value

Whenever we don’t have a value, we can put a `NULL`

`NULL` can mean many things:
* Value does not exists
* Value exists but is unknown
* Value not applicable etc

Insert the following record into the database:

In [130]:
%%sql
INSERT INTO department VALUES ("Test","10","555555500",NULL);

Select *
from department;

 * mysql+pymysql://root:***@localhost/
1 rows affected.
7 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1)),
 ('Test', 10, '555555500', None)]

Find out how you can filter out NULL values in SQL (i.e. display the record where mgrstartdate is `NULL`.

In [132]:
%%sql
SELECT *
FROM department
WHERE mgrstartdate IS NOT NULL

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1))]

Execute the code below. What do you observe?

In [135]:
%%sql 
SELECT *
FROM department
WHERE mgrstartdate > '1985-01-01' or mgrstartdate <= '1985-01-01';

 * mysql+pymysql://root:***@localhost/
6 rows affected.

[('Headquarters', 1, '888665555', datetime.date(1971, 6, 19)),
 ('Administration', 4, '987654321', datetime.date(1985, 1, 1)),
 ('Research', 5, '333445555', datetime.date(1978, 5, 22)),
 ('Software', 6, '111111100', datetime.date(1999, 5, 15)),
 ('Hardware', 7, '444444400', datetime.date(1998, 5, 15)),
 ('Sales', 8, '555555500', datetime.date(1997, 1, 1))]

# Type your observation here
## Both using NOT NULL and checking for values in the column is greater or equals OR lesser than eliminate any rows with null values

<font color='red'>**Before your submit, please make sure to click Kernel > Restart & Run All so that the output is shown.**</font>

### Submission Instructions

<div class="alert alert-block alert-info">
    
#### Upload to Coursemology

Upload the `.ipynb` to Coursemology. Name the file in the following format: `Lab<num><YourName>.ipynb`.

#### Print to OneNote

Print the `.ipynb` to OneNote > Individual Student Space > Lab folder
    
</div>

<hr>
© NUS High School of Math & Science